import * as React from 'react'
import './style.css'

import { appRoutes } from 'root/appRoutes'
import { GradientButton } from 'components/common/buttons/gradient-button/GradientButton'

export const PromoPage: React.FC = () => {
  return (
    <main className='site-content' id='promo-page'>
      <section id='block1' className='container screen flex-center'>
        <h3>Интерактивный видеоконтент</h3>

        <h1>INTERCHOICE</h1>

        <p>Твой выбор. Твой стиль. Твоя история.</p>

        <GradientButton href={appRoutes.createMovie()}>Создать свой фильм</GradientButton>
      </section>

      <div className='b2'>
        <section id='block2' className='container container-ordinal screen b2'>
          <div className='grid grid-2'>
            <div id='block2-1'>
              <img src='/imgs/block-2.jpg' />
            </div>

            <div id='block2-2'>
              <h4>Просто попробуй</h4>

              <div className='text-size-1'>
                <h2>Интерактивный видео-контент: что это?</h2>

                <p>
                  Интерактивное кино — это такое кино, которое позволяет своим зрителям не только
                  смотреть киноленту, но и принять в ней активное участие. Зритель принимает
                  ключевые решения, которые меняют развитие сюжета.
                </p>

                <p>
                  До сих пор возможности создания и просмотра интерактивных фильмов не были доступны
                  всем желающим, но наш сервис меняет это раз и навсегда!
                </p>

                <p>
                  Interchoice - первый в мире сервис по созданию и простотру интерактивного кино!
                </p>
              </div>

              <GradientButton href={appRoutes.createMovie()}>Создай свой фильм</GradientButton>
            </div>
          </div>
        </section>

        <section id='block3' className='container container-ordinal'>
          <div className='grid grid-3 advantages'>
            <div className='advantage'>
              <div className='image-cont'>
                <svg
                  width='62'
                  height='62'
                  viewBox='0 0 62 62'
                  fill='none'
                  xmlns='http://www.w3.org/2000/svg'
                >
                  <path
                    d='M61.9188 2.5192C60.5131 7.20585 57.7644 16.0456 54.4953 25.2486C55.3429 25.5021 56.1185 25.733 56.7485 25.9259C57.023 26.0096 57.2757 26.153 57.4883 26.3459C57.7009 26.5388 57.8681 26.7763 57.9781 27.0414C58.088 27.3066 58.1379 27.5928 58.1242 27.8795C58.1105 28.1662 58.0335 28.4463 57.8987 28.6997C55.2218 33.8215 47.8854 47.2022 40.6455 54.6627C40.5244 54.7951 40.4033 54.9654 40.2822 55.0865C38.0917 57.2775 35.4911 59.0157 32.6289 60.2017C29.7666 61.3877 26.6988 61.9984 23.6005 61.9988C20.5023 61.9992 17.4343 61.3893 14.5717 60.204C11.7092 59.0188 9.10813 57.2813 6.91706 55.0908C4.72599 52.9002 2.98782 50.2996 1.80181 47.4374C0.615796 44.5751 0.00515818 41.5073 0.00476094 38.409C0.00436369 35.3108 0.614215 32.2428 1.79949 29.3803C2.98477 26.5177 4.72227 23.9166 6.91278 21.7256C7.03385 21.6045 7.20411 21.4834 7.33654 21.3623C14.7959 14.1081 28.1615 6.78202 33.2958 4.10664C33.5492 3.97185 33.8293 3.89483 34.116 3.88111C34.4027 3.86739 34.6889 3.9173 34.954 4.02727C35.2191 4.13724 35.4566 4.30454 35.6494 4.51716C35.8422 4.72977 35.9856 4.98244 36.0692 5.25702C36.2622 5.87383 36.493 6.66093 36.7465 7.50857C45.9368 4.23909 54.7867 1.48992 59.4726 0.0860031C59.8112 -0.0164079 60.1712 -0.0252665 60.5144 0.0603668C60.8576 0.146 61.1713 0.322932 61.4221 0.572395C61.6728 0.821858 61.8514 1.13455 61.9389 1.4773C62.0263 1.82005 62.0194 2.18008 61.9188 2.5192ZM38.7442 38.7504C38.7438 35.6853 37.8345 32.6892 36.1313 30.1409C34.4282 27.5927 32.0076 25.6066 29.1758 24.434C26.3439 23.2613 23.2279 22.9547 20.2218 23.553C17.2157 24.1512 14.4545 25.6274 12.2873 27.7948C10.1202 29.9623 8.64438 32.7237 8.04657 35.7299C7.44877 38.7361 7.7558 41.8521 8.92885 44.6837C10.1019 47.5154 12.0883 49.9357 14.6368 51.6385C17.1853 53.3413 20.1815 54.2502 23.2466 54.2502C25.282 54.2503 27.2974 53.8494 29.1779 53.0704C31.0583 52.2915 32.7669 51.1498 34.206 49.7104C35.6451 48.2711 36.7866 46.5624 37.5653 44.6818C38.344 42.8013 38.7446 40.7858 38.7442 38.7504ZM23.2466 34.8754C23.2465 35.6417 23.0191 36.3907 22.5934 37.0278C22.1676 37.6648 21.5624 38.1614 20.8545 38.4545C20.1465 38.7477 19.3675 38.8243 18.616 38.6748C17.8645 38.5252 17.1742 38.1562 16.6324 37.6143C16.0906 37.0724 15.7216 36.3821 15.5722 35.6305C15.4227 34.879 15.4995 34.1 15.7927 33.3921C16.086 32.6842 16.5826 32.0791 17.2197 31.6534C17.8569 31.2277 18.6059 31.0005 19.3722 31.0005C19.8812 30.9999 20.3853 31.0997 20.8556 31.2943C21.326 31.4888 21.7534 31.7742 22.1133 32.1342C22.4732 32.4941 22.7585 32.9215 22.953 33.3919C23.1475 33.8623 23.2472 34.3664 23.2466 34.8754H23.2466ZM27.121 44.5628C27.1209 44.9459 27.0073 45.3204 26.7944 45.639C26.5815 45.9575 26.2789 46.2058 25.9249 46.3523C25.5709 46.4989 25.1814 46.5373 24.8057 46.4625C24.4299 46.3877 24.0848 46.2032 23.8139 45.9322C23.543 45.6613 23.3585 45.3161 23.2838 44.9404C23.2091 44.5646 23.2474 44.1751 23.3941 43.8211C23.5407 43.4672 23.789 43.1646 24.1076 42.9518C24.4261 42.7389 24.8006 42.6253 25.1838 42.6253C25.6971 42.627 26.1889 42.8317 26.5518 43.1947C26.9148 43.5577 27.1194 44.0495 27.121 44.5628H27.121Z'
                    fill='#E32879'
                  />
                </svg>
              </div>

              <h3>Эксклюзивность</h3>

              <p>Interchoice - первый в мире сервис по созданию и просмотру интерактивного кино!</p>
            </div>

            <div className='advantage'>
              <div className='image-cont'>
                <svg
                  width='72'
                  height='62'
                  viewBox='0 0 72 62'
                  fill='none'
                  xmlns='http://www.w3.org/2000/svg'
                >
                  <path
                    d='M45.0276 29.3169L38.0389 43.0724C37.1952 44.7468 34.7485 44.6915 33.9751 42.9893L25.974 25.5113L21.7555 35.4335H8.52347L34.186 61.2423C35.1844 62.2526 36.8015 62.2526 37.7999 61.2423L63.4765 35.4335H48.1352L45.0276 29.3169ZM66.6123 5.80526L66.2748 5.45929C59.033 -1.81976 47.179 -1.81976 39.9232 5.45929L36 9.41711L32.0768 5.47313C24.835 -1.81977 12.967 -1.81977 5.7252 5.47313L5.38771 5.80526C-1.46033 12.6968 -1.75562 23.6708 4.36121 31.0052H18.7604L23.8085 19.0764C24.5679 17.2912 27.1271 17.2497 27.9427 19.021L36.1266 36.9142L43.0168 23.3663C43.8464 21.7334 46.2088 21.7334 47.0384 23.3663L50.9194 31.0052H67.6388C73.7556 23.6708 73.4603 12.6968 66.6123 5.80526Z'
                    fill='#E32879'
                  />
                </svg>
              </div>

              <h3>Погружение</h3>

              <p>Interchoice - шанс полностью погрузиться в историю и стать её частью!</p>
            </div>

            <div className='advantage'>
              <div className='image-cont'>
                <svg
                  width='57'
                  height='56'
                  viewBox='0 0 57 56'
                  fill='none'
                  xmlns='http://www.w3.org/2000/svg'
                >
                  <path
                    d='M41.4893 14.3919C37.9496 11.146 33.356 9.36675 28.4828 9.37097C19.7125 9.37851 12.1411 15.2677 10.0506 23.437C9.89846 24.0317 9.35746 24.4516 8.73144 24.4516H2.24326C1.39429 24.4516 0.749357 23.6968 0.906401 22.8797C3.35627 10.1387 14.7785 0.5 28.5 0.5C36.0236 0.5 42.856 3.39815 47.8973 8.11628L51.9411 4.15595C53.653 2.47945 56.58 3.66682 56.58 6.03781V20.9032C56.58 22.373 55.3634 23.5645 53.8626 23.5645H38.6836C36.2626 23.5645 35.0502 20.698 36.7621 19.0214L41.4893 14.3919ZM3.1374 32.4355H18.3163C20.7373 32.4355 21.9498 35.302 20.2379 36.9786L15.5107 41.6082C19.0504 44.8542 23.6443 46.6335 28.5176 46.6291C37.2834 46.6214 44.8578 40.7362 46.9493 32.5632C47.1015 31.9685 47.6425 31.5486 48.2685 31.5486H54.7568C55.6058 31.5486 56.2507 32.3034 56.0937 33.1205C53.6437 45.8612 42.2215 55.5 28.5 55.5C20.9764 55.5 14.144 52.6019 9.1027 47.8837L5.05884 51.8441C3.34698 53.5206 0.419983 52.3332 0.419983 49.9622V35.0968C0.419983 33.627 1.63659 32.4355 3.1374 32.4355Z'
                    fill='#E32879'
                  />
                </svg>
              </div>

              <h3>Переосмысление</h3>

              <p>Interchoice - первый в мире сервис по созданию и просмотру интерактивного кино!</p>
            </div>
          </div>
        </section>
      </div>

      <section id='block4' className='container'>
        <h4>Премьеры на Interchoice</h4>

        <h2>Новые публикации наших пользователей</h2>

        <img id='block4-stub' src='/imgs/block4-stub.png' />
      </section>

      <section id='block5' className='container'>
        <h2>INTERCHOICE - твой помошник в творчестве</h2>

        <p className='subtitle-1'>
          Сервис INTERCHOICE, дает своим пользователям возможность реализоваться в новом творческом
          направлении.
        </p>

        <GradientButton href={appRoutes.createMovie()} className='button-bright'>
          Попробовать прямо сейчас
        </GradientButton>
      </section>

      <section id='block6' className='container'>
        <div id='block6-1' className='text-center'>
          <h4>Несколько простых шагов</h4>

          <h2>Как создается интерактивный видеоконтент?</h2>
        </div>

        <div className='grid grid-2'>
          <div id='block6-list'>
            <ol>
              <li>Выберете в Меню пользователя пункт “Создать фильм”.</li>

              <li>
                Придумайте название для Вашего фильма и загрузите эффектное изображение в качестве
                заставки.
              </li>

              <li>
                Создавайте необходимое количество сцен, для Вашего кино, загружая заранее
                подготовленное видео.
              </li>

              <li>Чтобы просмотреть созданный фильм нажмите “Просмотр фильма” в Меню.</li>

              <li>
                Когда всё будет готово, нажмите “Опубликовать фильм” и ваше кино появляется в Ленте.
              </li>
            </ol>

            <GradientButton href={appRoutes.createMovie()}>Создать свой фильм</GradientButton>
          </div>

          <div id='block6-img'>
            <img src='/imgs/block6-imgs.png' />
          </div>
        </div>
      </section>

      <footer id='site-footer' className='site-footer'>
        <div className='contacts'>
          <span className='subtitle-1'>Как связаться с нами:</span>

          <span className='contact'>
            Телефон: <a href='tel:+7 (950) 479 01-56'>+7 (950) 479 01-56</a>
          </span>

          <span className='contact'>
            Е-mail: <a href='mailto:phanfisahardina@gmail.com'>phanfisahardina@gmail.com</a>
          </span>
        </div>

        <div id='copyright' className='copyright'>
          Interchoice © {new Date().getFullYear()}. Все права защищены.
        </div>
      </footer>
    </main>
  )
}
